shouldDo.org

* update tables
'C-c C-c' while the cursor is in the below code block updates (recalculates) the tables
#+begin_src emacs-lisp
(require 'org-table)
(org-table-iterate-buffer-tables)
#+end_src

#+results:
: t

* activities log
|---+----+----------------+----+----+----+----+----+----+----+--------+-------+------+---+----+--------|
| # | id | activity       | Mo | Tu | We | Th | Fr | Sa | Su | units  |  prog | goal | % | wt | points |
|---+----+----------------+----+----+----+----+----+----+----+--------+-------+------+---+----+--------|
| # |  1 | activity1 name |    |    |    |    |    |    |    | hrs    |     0 |    8 | 0 | 20 |   0.00 |
| # |  2 | activity2 name |    |    |    |    |    |    |    | hrs    |     0 |    4 | 0 |  5 |   0.00 |
| # |  3 | activity3 name |    |    |    |    |    |    |    | meals  |     0 |    5 | 0 | 20 |   0.00 |
| # |  4 | activity4 name |    |    |    |    |    |    |    | n#     |     0 |   10 | 0 | 30 |   0.00 |
| # |  5 | activity5 name |    |    |    |    |    |    |    | pages  |     0 |   30 | 0 |  5 |   0.00 |
| # |  6 | activity6 name |    |    |    |    |    |    |    | miles  |     0 |    7 | 0 | 10 |   0.00 |
| # |  7 | activity7 name |    |    |    |    |    |    |    | smiles |     0 |   42 | 0 | 10 |   0.00 |
| # |  8 | 0              |    |    |    |    |    |    |    | 0      |     0 |    0 | 0 |  0 |   0.00 |
| # |  9 | 0              |    |    |    |    |    |    |    | 0      |     0 |    0 | 0 |  0 |   0.00 |
| # | 10 | 0              |    |    |    |    |    |    |    | 0      |     0 |    0 | 0 |  0 |   0.00 |
|---+----+----------------+----+----+----+----+----+----+----+--------+-------+------+---+----+--------|
| # |  y | 2011           | w# | 52 |    |    |    |    |    |        | SCORE |      |   |    |   0.00 |
|---+----+----------------+----+----+----+----+----+----+----+--------+-------+------+---+----+--------|
  #+TBLFM: @1$1='(format "#")::@2$1='(format "#")::@3$1='(format "#")::@4$1='(format "#")::@5$1='(format "#")::@6$1='(format "#")::@7$1='(format "#")::@8$1='(format "#")::@9$1='(format "#")::@10$1='(format "#")::@11$1='(format "#")::@12$1='(format "#")::$2=remote(a,@@#$2)::$3=remote(a,@@#$3)::$11=remote(a,@@#$5)::$12=vsum($4..$10);N::$13=remote(a,@@#$4);N::$14=($12/$13)*100;%.0f::$15=remote(a,@@#$6);N::$16=($12/$13)*$15;%.2f::@1$2=id::@1$3=activity::@1$4=Mo::@1$5=Tu::@1$6=We::@1$7=Th::@1$8=Fr::@1$9=Sa::@1$10=Su::@1$11=units::@1$12=prog::@1$13=goal::@1$14='(format "%%")::@1$15=wt::@1$16=points::@12$2=y::@12$3='(print(format-time-string "%Y"))::@12$4='(format "w#")::@12$5='(print(format-time-string "%W"))::@12$6='(format "")::@12$7='(format "")::@12$8='(format "")::@12$9='(format "")::@12$10='(format "")::@12$11='(format "")::@12$12=SCORE::@12$13='(format "")::@12$14='(format "")::@12$15='(format "")::@12$16=vsum(@II..III);%.2f

* scores
|---+---------------+------|
| # | scores        |      |
|---+---------------+------|
| # | avg           | 0.00 |
| # | last week     | 0.00 |
| # | past month    | 0.00 |
| # | past 3 months | 0.00 |
| # | past 6 months | 0.00 |
| # | past year     | 0.00 |
|---+---------------+------|
  #+TBLFM: @1$1='(format "#")::@2$1='(format "#")::@3$1='(format "#")::@4$1='(format "#")::@5$1='(format "#")::@6$1='(format "#")::@7$1='(format "#")::@1$2=scores::@1$3='(format "")::@2$2=avg::@3$2='(format "last week")::@4$2='(format "past month")::@5$2='(format "past 3 months")::@6$2='(format "past 6 months")::@7$2='(format "past year")::@2$3=remote(h,@2$5);%.2f::@3$3=remote(h,@2$4);%.2f::@4$3=remote(h,@2$6);%.2f::@5$3=remote(h,@2$7);%.2f::@6$3=remote(h,@2$8);%.2f::@7$3=remote(h,@2$9);%.2f

* view history
  :PROPERTIES:
  :VISIBILITY: folded
  :END:
#+TBLNAME: h
|---+------+------+-------+------+---+-----+-----+---|
| # | year | week | score | avg  | m | 3 m | 6 m | y |
|---+------+------+-------+------+---+-----+-----+---|
| # |      |      |       | 0.00 |   |     |     |   |
|---+------+------+-------+------+---+-----+-----+---|
  #+TBLFM: $1='(format "#")::@1$2=year::@1$3=week::@1$4=score::$5='(format "")::$6='(format "")::$7='(format "")::$8='(format "")::$9='(format "")::@1$5=avg::@1$6=m::@1$7=3m::@1$8=6m::@1$9=y::@2$5=vmean(@II..III$3);%.2f::@2$6=vmean(@2..@6$3);%.2f::@2$7=vmean(@2..@14$3);%.2f::@2$8=vmean(@2..@26$3);%.2f::@2$9=vmean(@2..@54$3);%.2f

* edit activities
  :PROPERTIES:
  :VISIBILITY: folded
  :END:
#+TBLNAME: a
|---+----+----------------+-------------+--------+--------|
| # | id | activity name  | weekly goal | units  | weight |
|---+----+----------------+-------------+--------+--------|
| # |  1 | activity1 name |           8 | hrs    |     20 |
| # |  2 | activity2 name |           4 | hrs    |      5 |
| # |  3 | activity3 name |           5 | meals  |     20 |
| # |  4 | activity4 name |          10 | n#     |     30 |
| # |  5 | activity5 name |          30 | pages  |      5 |
| # |  6 | activity6 name |           7 | miles  |     10 |
| # |  7 | activity7 name |          42 | smiles |     10 |
| # |  8 |                |             |        |        |
| # |  9 |                |             |        |        |
| # | 10 |                |             |        |        |
|---+----+----------------+-------------+--------+--------|
| # |    | TOTAL          |             |        |    100 |
|---+----+----------------+-------------+--------+--------|
  #+TBLFM: @1$1='(format "#")::@2$1='(format "#")::@3$1='(format "#")::@4$1='(format "#")::@5$1='(format "#")::@6$1='(format "#")::@7$1='(format "#")::@8$1='(format "#")::@9$1='(format "#")::@10$1='(format "#")::@11$1='(format "#")::@12$1='(format "#")::@1$2=id::@1$3='(format "activity name")::@1$4='(format "weekly goal")::@1$5=units::@1$6=weight::$2=@-1 + 1::@2$2=1::@12$2='(format "")::@12$3=TOTAL::@12$4='(format "")::@12$5='(format "")::@12$6=vsum(@II..III)

The total weight for all activities must equal 100 (or whatever number you wish to be considered a perfect score).
An activity with no weight is not counted toward or against your score.
Example units: n#, hrs, deliverables, pages, meals, miles, km, smiles (note that "#" by itself will cause an error).

* settings
  :PROPERTIES:
  :VISIBILITY: folded
  :FILENAME: shouldDo.org
  :VERSION:  1.7.1
  :DATE:     2011/12/26
  :URL:      http://shouldDo.org
  :AUTHOR:   Ben Gerber (http://privacy.us/contact  http://twitter.com/gerber ) 
  :COPYRIGHT: (C) Ben Gerber 2009, 2011
  :LICENSE:  Creative Commons Attribution 3.0 License (http://creativecommons.org/licenses/by/3.0/ )
  :END:
** display on open
#+STARTUP: showall
